Revit 2027 API
FamilyManager.MakeType Method
Set the family parameter as a type parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MakeType(
	FamilyParameter familyParameter
)
Public Sub MakeType (
	familyParameter As FamilyParameter
)
public:
void MakeType(
	FamilyParameter^ familyParameter
)
member MakeType :
        familyParameter : FamilyParameter -> unit
Parameters
familyParameter FamilyParameter
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace